docs/notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-11-21 Sat 23:02 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Notes</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">Notes</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org7ae6b0b">C++</a>
<ul>
<li><a href="#org7e3e34d">Back to Basics: Move Semantics (part 1)</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org7ae6b0b" class="outline-2">
<h2 id="org7ae6b0b">C++</h2>
<div class="outline-text-2" id="text-org7ae6b0b">
</div>
<div id="outline-container-org7e3e34d" class="outline-3">
<h3 id="org7e3e34d">Back to Basics: Move Semantics (part 1)</h3>
<div class="outline-text-3" id="text-org7e3e34d">
<p><b>Author:</b> Klaus Iglberger<br/><b>Source:</b> <a href="https://www.youtube.com/watch?v=St0MNEU5b0o">https://www.youtube.com/watch?v=St0MNEU5b0o</a></p>
</div>
<div id="outline-container-org1ea607e" class="outline-4">
<h4 id="org1ea607e">Lvalues and Rvalues</h4>
<div class="outline-text-4" id="text-org1ea607e">
<p>
Lvalues have a name, there is an identifier that the programmer provides to represent the object.
Rvalues don't have a name.
It used to be rvalues only appeared on the right side of an assignment (thus right values) 
(though lvalues could be on both sides) but that's no longer true.
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #ee99ff;">int</span> <span style="color: #eedd82;">i</span> = 3 + 2; <span style="color: #b7c796;">// </span><span style="color: #b7c796;">i is an lvalue and '3+2' is an rvalue</span>
<span style="color: #ee99ff;">int</span> <span style="color: #eedd82;">x</span> = i; <span style="color: #b7c796;">// </span><span style="color: #b7c796;">both x and i are lvalues</span>
</pre>
</div>
<p>
<code>v2 = v1</code> is a copy since 'v1' is a lvalue and so binds to a reference.
Rvalue references were added to distinguish between lvalues and rvalues in function arguments 
[maybe elsewhere too, not sure] and are signified by <code>&amp;&amp;</code> (as in <code>vector&lt;int&gt;&amp;&amp;</code>).
Rvalues will bind to rvalue references which is why rvalue references are the 
arguments of move operations.
</p>

<p>
<code>std::move</code> itself doesn't actually move anything it just unconditionally casts an lvalue 
to an rvalue reference (technically called an Xvalue (expiring value)).
This will cause a move operation to be used.
</p>
</div>
</div>

<div id="outline-container-org1ed601e" class="outline-4">
<h4 id="org1ed601e">Move Operations</h4>
<div class="outline-text-4" id="text-org1ed601e">
<p>
If all member variables of a class have move operations defined (or are POD) then allow the 
compiler to generate the move operations of the class.
The move operations need to be defined if there are resources to be managed.
<b><b>Remember the rvalue reference passed into a move operator is itself an lvalue.</b></b>
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #ee99ff;">MyClass</span>&amp; <span style="color: #ff6347;">operator</span><span style="color: #66fc4c;">=</span><span style="color: #ffffff;">(</span><span style="color: #ee99ff;">MyClass</span>&amp;&amp; <span style="color: #eedd82;">c</span><span style="color: #ffffff;">)</span> <span style="color: #ffffff;">{</span>
    <span style="color: #b7c796;">// </span><span style="color: #b7c796;">c is an lvalue (it has a name)</span>
    <span style="color: #ff6347;">this</span>-&gt;member = c.member; <span style="color: #b7c796;">// </span><span style="color: #b7c796;">so this would be a copy</span>
    <span style="color: #b7c796;">// </span><span style="color: #b7c796;">so should do</span>
    <span style="color: #ff6347;">this</span>-&gt;member = <span style="color: #7fffd4;">std</span>::move<span style="color: #00bfff;">(</span>c.member<span style="color: #00bfff;">)</span>;
<span style="color: #ffffff;">}</span>
</pre>
</div>

<p>
When defining move operations make sure to explicitely move all the members that need it.
The easiest thing to do is just call <code>std::move</code> on all members variables.
This won't affect fundamental types (it will still do the copy) but it keeps everything 
looking the same and nothing will be accidentally missed.
</p>

<p>
A move constructor has two phases:
</p>
<ol class="org-ol">
<li>Member-wise move</li>
<li>Reset the source object (setting pointer to null). Otherwise the two objects would free the
same memory when destroyed.</li>
</ol>
<p>
If only 1) is present then the default move constructor can be used.
</p>

<p>
A move assignment operator has three phases: 
</p>
<ol class="org-ol">
<li>Cleanup original resources in the destination object. This duplicates the destructor.</li>
<li>Member-wise move.</li>
<li>Reset the source object (setting pointers to null).</li>
</ol>
<p>
If 2) is the only step present then the default move assignment operator can be used.
</p>

<p>
<code>std::exchange</code> can set the a pointer and return the original value (to make the reset step 
easier).
</p>

<p>
<b>Mark move operations noexcept.</b>
This can lead to performance improvements.
Move operations should leave the source object in valid but undefined 
(though preferably default) state.
</p>
</div>
</div>

<div id="outline-container-orgdca05e6" class="outline-4">
<h4 id="orgdca05e6">Default Move Ops</h4>
<div class="outline-text-4" id="text-orgdca05e6">
<p>
Default move ops are generated if no copy operations or the destructor are user defined.
Default copy ops are generated if no move operations are user-defined.
"User-defined" includes setting <code>=default</code> and <code>=delete</code>.
Don't define any of the default operations if you don't need to (Rule of Zero).
If you define any of the default operations (destructor, move constructor, move assignment, copy constructor, copy assignment) define all of the them (Rule of Five).
</p>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
